Repository: Dariaa14/eStateMarket
Catalog: estate_market/lib/l10n/app_*.arb
Languages: ro

source: Login
ro: Autentificare

source: Signup
ro: Înregistrare

# email
source: Email address
ro: Adresă de email

source: Password
ro: Parolă

source: Password strength
ro: Puterea parolei

source: Stay connected
ro: Rămâi conectat

source: Search
ro: Căutare

source: Main categories
ro: Principalele categorii

# usedEmail
source: The provided email is already registered. Please use a different email address.
ro: Adresa de email furnizată este deja înregistrată. Vă rugăm să utilizați o altă adresă de email.

# invalidEmail
source: Please provide a valid email address.
ro: Vă rugăm să furnizați o adresă de email validă.

# passwordTooWeak
source: The provided password is too weak.
ro: Parola furnizată este prea slabă

# passwordTooShort
source: The provided password is too short. It must be at least 8 characters long.
ro: Parola furnizată este prea scurtă. Trebuie să aibă cel puțin 8 caractere.

# invalidCredential
source: Invalid email or password. Please check your credentials and try again.
ro: Email sau parolă incorectă. Verificați-vă datele de conectare și încercați din nou.

# missingEmail
source: Email is required. Please provide your email address.
ro: Este necesară adresa de email. Vă rugăm să furnizați adresa dvs. de email.

# missingPassword
source: Password is required. Please enter your password.
ro: Este necesară parola. Vă rugăm să introduceți parola.

# networkRequestFailure
source: We couldn't complete your request due to a network issue. Please check your internet connection and try again.
ro: Nu am putut finaliza cererea dvs. din cauza unei probleme de rețea. Verificați conexiunea la internet și încercați din nou.

source: Explore
ro: Explorare

source: Favorites
ro: Favorite

# addAdd
source: Add ad
ro: Adaugă anunț

source: Photo editor
ro: Editor de fotografii

source: Profile
ro: Profil

source: Settings
ro: Setări

# adDetails
source: Details about the ad:
ro: Detalii despre anunț:

# adTitle
source: Title
ro: Titlu anunț*

# adTitleHintText
source: Enter a descriptive title for your ad
ro: Introduceți un titlu descriptiv pentru anunțul dvs.

# adCategory
source: Category*
ro: Categorie*

# adDescription
source: Description
ro: Descriere anunț*

# adDescriptionHintText
source: Enter a detailed description of your ad
ro: Introduceți o descriere detaliată a anunțului dvs.

source: Post ad
ro: Postează anunț

source: Listing type
ro: Tip de listare*

source: Land use category
ro: Categorie de utilizare a terenului*

source: Inside build-up area
ro: Zonă de construcție interioară

source: Outside build-up area
ro: Zonă de construcție exterioară

source: Number of rooms
ro: Număr de camere*

# numberOfRoomsHintText
source: Add number of rooms
ro: Adăugați numărul de camere

source: Number of bathrooms
ro: Număr de băi*

# numberOfBathroomsHintText
source: Add number of bathrooms
ro: Adăugați numărul de băi

source: Furnishing level
ro: Nivel de mobilare*

source: Inside surface
ro: Suprafață interioară*

# insideSurfaceHintText
source: Add the inside surface
ro: Adăugați suprafața interioară

source: Outside surface
ro: Suprafață exterioară*

# outsideSurfaceHintText
source: Add the outside surface
ro: Adăugați suprafața exterioară

source: Number of floors
ro: Număr de etaje*

# numberOfFloorsHintText
source: Add the number of floors in the building
ro: Adăugați numărul de etaje în clădire

source: Parking type
ro: Tip de parcare*

source: Capacity of garage
ro: Capacitatea garajului*

# capacityOfGarageHintText
source: Add capacity of garage
ro: Adăugați capacitatea garajului

source: Height
ro: Înălțime*

# heightHintText
source: Add the height
ro: Adăugați înălțimea

source: Usable surface
ro: Suprafață utilă*

# usableSurfaceHintText
source: Add the usable surface
ro: Adăugați suprafața utilă

source: Administrative surface
ro: Suprafață administrativă*

# administrativeSurfaceHintText
source: Add the administrative surface
ro: Adăugați suprafața administrativă

source: Deposit type
ro: Tip de depozit*

source: Parking spaces
ro: Locuri de parcare*

# parkingSpacesHintText
source: Add the number of parking spaces
ro: Adăugați numărul de locuri de parcare

source: Partitioning level
ro: Nivel de compartimentare*

# floorNumber
source: Floor
ro: Număr de etaj*

# floorNumberHintText
source: Add the floor number
ro: Adăugați numărul etajului

# propertyDetails
source: Details about the property:
ro: Detalii despre proprietate:

source: Surface
ro: Suprafață*

# surfaceHintText
source: Add the surface
ro: Adăugați suprafața

source: Price
ro: Preț*

# priceHintText
source: Add the price
ro: Adăugați prețul

source: Construction year
ro: Anul construcției

# constructionYearHintText
source: Add the construction year
ro: Adăugați anul construcției

source: Negotiable
ro: Negociabil

source: Non-negotiable
ro: Non-negociabil

# requiredField
source: Field is required
ro: Câmpul este obligatoriu

source: Apartment
ro: Apartament

source: House
ro: Casă

source: Terrain
ro: Teren

source: Garage
ro: Garaj

source: Deposit
ro: Depozit

source: Sale
ro: Vânzare

source: Rent
ro: Închiriere

source: Furnished
ro: Mobilat

source: Semi-furnished
ro: Parțial mobilat

source: Unfurnished
ro: Nemobilat

source: Self-contained
ro: Autonom

source: Semi self-contained
ro: Parțial autonom

source: Non self-contained
ro: Non-autonom

source: Agriculture
ro: Agricol

source: Rangeland
ro: Pășune

source: Forestland
ro: Pădure

source: Water
ro: Apa

source: Wetland
ro: Zonă umedă

source: Barren
ro: Steril

source: Interior Parking
ro: Parcare interioară

source: Exterior Parking
ro: Parcare exterioară

source: Distribution
ro: Distribuție

source: Production
ro: Producție

source: Add images
ro: Adaugă imagini

source: Individual
ro: Persoană fizică

source: Company
ro: Firmă

source: Save
ro: Salvează

source: Phone number:
ro: Număr de telefon:

source: Type of seller:
ro: Tip de vânzător:
